local init = {}

-- setting load
--------------------------------------------------------------------------------
init.setting = require('settings/setting')
init.setting.init()
--------------------------------------------------------------------------------

-- global
--------------------------------------------------------------------------------
SETTING = init.setting.getSetting()
DEFAULT_FUNCTION = require('libraries/default_function')
SOUND_EFFECT = require('libraries/sound_effect')
SOUND_EFFECT.init(SETTING['soundEffect'])
--------------------------------------------------------------------------------

-- 機能をロード
--------------------------------------------------------------------------------
init.windowManager = require('managers/window_manager')
init.windowManager.init(SETTING['windowManager'])
require('managers/keyboard_manager').init()
require('managers/mouse_manager').init()
--------------------------------------------------------------------------------

-- urlevent
------------------------------------------------------------------------------
require('managers/urlevent_manager').init(init)
------------------------------------------------------------------------------

-- loadEnd
------------------------------------------------------------------------------
SOUND_EFFECT.soundEffect('loadEnd')

hs.alert.show(
[[

    私のスピードに
    　-= ∧＿∧
    -=と(´･ω･`)　ｼｭﾀｯ
    　-=/　と_ノ
    -=_/／⌒ｿ

    ついてこれるかな？
     ∧＿∧ =-
    (´･ω･`)`つ=-　ｻﾞｻﾞｯ
    　`つ \ =-
    　\,⌒＼\,,,_=-

]]
)
------------------------------------------------------------------------------

-- todo

-- 効果音
-- imeが日本語時
-- タブ切り替え時
-- カーソルやエンター
-- 長時間連打のコンボ

-- ウィンドウ操作
-- ウィンドウループ移動

-- タブ変更やウィンドウ変更などの処理前 & 処理後に 処理を入れる
-- TextScrubのようなクリップボードに対しての正規表現

-- マウスジャンプ 左のキーでざっくり
-- alert でクリップボードとかの通知
